WuYingzheng/stm32f4_freeRTOS_TCP_UDP/FreeRTOS-Plus/Demo/stm32f4xx_tcp_fat_freeRTOS/src/main.c
		PB5     ------> ETH_PPS_OUT
	//	PB8     ------> ETH_TXD3

	**	PC1     ------> ETH_MDC
	//	PC2     ------> ETH_TXD2
	//	PC3     ------> ETH_TX_CLK
	**	PC4     ------> ETH_RXD0
	**	PC5     ------> ETH_RXD1

	**	PG14     ------> ETH_TXD1
	**	PG13     ------> ETH_TXD0
	**	PG11     ------> ETH_TX_EN

	//	PH2     ------> ETH_CRS
	//	PH3     ------> ETH_COL
	//	PH6     ------> ETH_RXD2
	//	PH7     ------> ETH_RXD3

	//	PI10     ------> ETH_RX_ER 悬空
		*/

		  /* Enable SYSCFG clock */
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE); //协议栈移植层有

	//	GPIO_InitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_5;
	//	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	//	GPIO_InitStruct.Pull = GPIO_NOPULL;
	//	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	//	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	//	HAL_GPIO_Init( GPIOB, &GPIO_InitStruct );

		GPIO_InitStruct.Pin = GPIO_PIN_14 | GPIO_PIN_13 | GPIO_PIN_11;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init( GPIOG, &GPIO_InitStruct );

//		GPIO_InitStruct.Pin = GPIO_PIN_10;
//		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//		GPIO_InitStruct.Pull = GPIO_NOPULL;
//		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
//		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
//		HAL_GPIO_Init( GPIOI, &GPIO_InitStruct );

	//	GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_7;
	//	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	//	GPIO_InitStruct.Pull = GPIO_NOPULL;
	//	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	//	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	//	HAL_GPIO_Init( GPIOH, &GPIO_InitStruct );

		GPIO_InitStruct.Pin = GPIO_PIN_1  | GPIO_PIN_4 | GPIO_PIN_5;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init( GPIOC, &GPIO_InitStruct );

		GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init( GPIOA, &GPIO_InitStruct );

		GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init( GPIOA, &GPIO_InitStruct );

//下面的代码设置PA8为时钟输出
//		GPIO_InitStruct.Pin = GPIO_PIN_8;
//		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//		GPIO_InitStruct.Pull = GPIO_NOPULL;
//		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
//		GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
//		HAL_GPIO_Init( GPIOA, &GPIO_InitStruct );

		HAL_NVIC_SetPriority( ETH_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY, 0 );
		HAL_NVIC_EnableIRQ( ETH_IRQn );
	}
}


